[
    {
        "title": "„Niemand hat mehr Lust auf klassische Bibliotheksführungen!“ – Ein Escape-Game als Erstsemestereinführung",
        "link": "https:\/\/doi.org\/10.1515\/iwp-2025-2036",
        "authors": [
            "Christian Imwalle",
            "Christoph Kraft",
            "Jessica Roschanski",
            "Lea Schlicher"
        ],
        "pubDate": "Fri, 03 Oct 2025 00:00:00 +0000",
        "abstract": "Zusammenfassung Escape-Rooms sind in wissenschaftlichen Bibliotheken noch eine Rarität. In einem studentischen Projekt der Technischen Hochschule Köln wurde 2024 ein Escape-Room für eine praxisorientierte Einführung in die Bibliotheksnutzung und Literaturrecherche am Leonardo-Campus an der FH Münster entwickelt. Über die klassischen Bibliotheksinhalte hinaus sollen neue Architektur-Studierende die baulichen Besonderheiten des Bibliotheksgebäudes und dessen interessante Geschichte in Form einer interaktiven „Zeitreise“ erleben. Abstract Escape rooms are still a rarity in academic libraries. In 2024, a student project at Cologne University of Applied Sciences developed an escape room for Leonardo Campus of Münster University of Applied Sciences. In addition to covering classic library topics, new architecture students experience the building’s structural features and its fascinating history through an interactive “journey through time”. Résumée Les escape rooms sont encore une rareté dans les bibliothèques scientifiques. Dans le cadre d’un projet d’étudiants de la Technische Hochschule Köln, une escape room a été développée en 2024 pour une introduction pratique à l’utilisation de la bibliothèque et à la recherche documentaire sur le campus Leonardo de la Fachhochschule Münster. Au-delà des contenus classiques de la bibliothèque, les nouveaux étudiants en architecture doivent découvrir les particularités architecturales du bâtiment de la bibliothèque et son histoire intéressante sous la forme d’un „voyage dans le temps“ interactif. Deskriptoren: Escape-Room; Informationskompetenz; Bibliothek; Literaturrecherche; Bibliotheksdidaktik; TIP Award 2025Descriptors: Escape room; information literacy; library introduction; literature research; library didactics; TIP Award 2025Descripteurs: Escape Room; Compétence informationnelle; Introduction à la bibliothèque; Recherche documentaire; Didactique de la bibliothèque; TIP Award 2025Über den Autor \/ die AutorinLea Schlicher M.Sc. Alle vier Mitglieder des Projektteams sind Studierende im dritten Master-Semester des Studienganges Library and Information Science (MALIS) an der TH Köln. Ihre Arbeit wurde mit dem TIP Award 2025 ausgezeichnet. Literatur Bau- und Liegenschaftsbetrieb NRW, 2009. Die Gebäude des Leonardo Campus und ihre Geschichte [online]. Münster: Bau- und Liegenschaftsbetrieb NRW, 30.06.2009. https:\/\/www.stadt-muenster.de\/fileadmin\/user_upload\/stadt-muenster\/61_stadtplanung\/pdf\/konversion\/LeonardoCampusRundgang.pdf [26.5.2025].Search in Google Scholar Blümig, Gabriele und Anna Klostermann, 2020. Rettet das Wissen! – Ein Praxisbericht rund um ein Live Escape Game im Lesesaal der Universitätsbibliothek Würzburg. In: o-bib. Das offene Bibliotheksportal. 7 (2020) Nr. 2, S. 1–9. 2363–9814. doi: 10.5282\/o-bib\/5572Search in Google Scholar Büchereizentrale Niedersachsen, o. J. Escape Games in Bibliotheken. [online] Eine praktische Arbeitshilfe zum Spielen eines Escape Games mit Jugendlichen oder Erwachsenen in der Bibliothek. Lüneburg: Büchereizentrale Niedersachsen, o. J. https:\/\/www.bz-niedersachsen.de\/escape-room.html [26.5.2025].Search in Google Scholar Burdinski, Dirk und Marc Leimenstoll, 2021. Dem Studientrott entkommen: Ein Escape-Room als Einstiegsprojekt. In: Die Neue Hochschule für anwendungsbezogene Wissenschaft und Kunst. 62 (2021) 3, S. 8–11. 0340–448X. https:\/\/www.hlb.de\/fileadmin\/hlb-global\/downloads\/dnh\/full\/2021\/DNH_2021-3.pdf [26.05.2025].Search in Google Scholar Deci, Edward L. und Ryan, Richard M., 1993: Die Selbstbestimmungstheorie der Motivation und ihre Bedeutung für die Pädagogik. In: Zeitschrift für Pädagogik. 39 (1993) 2, S. 223–238. 0044–3247. doi: 10.25656\/01:11173Search in Google Scholar Deci, Edward L. und Ryan, Richard M., 2008: Self-Determination Theory: A Macrotheory of Human Motivation, Development, and Health. In: Canadian Psychology. 48 (2008) 3, S. 182–185. 0708-5591.Search in Google Scholar Hanke, Ulrike und Wilfried Sühl-Strohmenger, 2016. Bibliotheksdidaktik. Grundlagen zur Förderung von Informationskompetenz. 2. Auflage. Berlin, Boston: De Gruyter Saur. 978-3-110-35241-2. (Bibliotheks- und Informationspraxis 58). doi: 10.1515\/9783110352559Search in Google Scholar Hunicke, Robin; Marc LeBlanc und Robert Zubek: MDA: A Formal Approach to Game Design and Game Research [online]. o. O: Robin Hunicke; Marc LeBlanc und Robert Zubek, 2004. https:\/\/cdn.aaai.org\/Workshops\/2004\/WS-04-04\/WS04-04-001.pdf [28.5.2025].Search in Google Scholar Nicholson, Scott, 2015: Peeking Behind the Locked Door: A Survey of Escape Room Facilities [online]. o. O.: Scott Nicholson, o. J. http:\/\/scottnicholson.com\/pubs\/erfacwhite.pdf [26.5.2025].Search in Google Scholar Planungsgemeinschaft zauberscho[e]n, 2012. Das Pferd an der Decke [online]. Neue Stellungen vor den Stallungen. Münster: Planungsgemeinschaft zauberscho[e]n, o. J. http:\/\/www.zauberschon.eu\/bibliothek\/index18.html [26.5.2025].Search in Google Scholar Robrecht, Michèle, 2023. Online Escape Game zur Förderung der Informationskompetenz bei Studierenden der Ingenieurwissenschaften. In: o-bib. Das offene Bibliotheksportal. 10 (2023) 1, S. 1–18. 2363–9814. doi: \/10.5282\/o-bib\/5914Search in Google Scholar Schewior-Popp, Susanne, 2014. Lernsituationen planen und gestalten. Handlungsorientierter Unterricht im Lernkontext. 2. Auflage. Stuttgart: Georg Thieme Verlag, 978-3-131-40752-8. Search in Google Scholar Online erschienen: 2025-10-03© 2025 Walter de Gruyter GmbH, Berlin\/Boston",
        "abstractEn": "",
        "categories": [
            "Information – Wissenschaft & Praxis"
        ],
        "lang": "de",
        "guid": "https:\/\/doi.org\/10.1515\/iwp-2025-2036"
    },
    {
        "title": "Retraction of: Quo vadis – deutsches Bildungs- und Wissenschaftsurheberrecht?",
        "link": "https:\/\/doi.org\/10.1515\/iwp-2017-5005",
        "authors": [
            "Rainer Kuhlen"
        ],
        "pubDate": "Thu, 28 Sep 2017 00:00:00 +0000",
        "abstract": "No abstract available",
        "abstractEn": "",
        "categories": [
            "Information – Wissenschaft & Praxis"
        ],
        "lang": "unknown",
        "guid": "https:\/\/doi.org\/10.1515\/iwp-2017-5005"
    },
    {
        "title": "Quo vadis – deutsches Bildungs- und Wissenschaftsurheberrecht?",
        "link": "https:\/\/doi.org\/10.1515\/iwp-2017-0027",
        "authors": [
            "Rainer Kuhlen"
        ],
        "pubDate": "Fri, 05 May 2017 00:00:00 +0000",
        "abstract": "ZusammenfassungDer aktuelle Referentenentwurf (RefE) des BMJV zur Reform des deutschen Urheberrechts wird aus der Perspektive von Bildung und Wissenschaft diskutiert. Der Vorschlag ist als Reaktion auf die offensichtlichen Probleme mit den bestehenden, auf Bildung und Wissenschaft bezogenen Bestimmungen des Urheberrechts zu verstehen. Auf diese Probleme wird in Kap. 2 eingegangen. Die vorgesehenen neuen Schrankenregelungen werden im Detail vorgestellt (Kap. 3) und kritisch (ablehnend und konstruktiv weiterführend) diskutiert (Kap. 4). Der Vorschlag wird auch unter der Vorgabe der Bundesregierung bewertet, ob das ursprünglich vorgesehene Ziel einer Allgemeinen Bildungs- und Wissenschaftsschranke erreicht werden konnte, oder ob zumindest der jetzige Vorschlag als akzeptable (Zwischen-) Lösung für ein zeitgemäßes Wissenschaftsurheberrecht angesehen werden kann (Kap. 5). Abschließend wird in Kap. 6 darauf eingegangen, ob der Prozess der parlamentarischen Beratung dieses RefE noch in dieser Legislaturperiode abgeschlossen werden kann. Im Anhang werden die Texte der acht neuen, jetzt vorgesehenen Schrankenregelungen aufgeführt.[1]AbstractThe current proposal by the German Federal Ministry of Justice and Consumer Protection for a reform of the German copyright law will be discussed from the perspective of education and science. The proposal tries to overcome the deficits of the existing copyright exceptions and limitations as far as education and science are concerned. We discuss these deficits in Sect. 3. The new exceptions will be explained in detail in Sect. 3 and their pros und cons will be discussed in Sect. 4. In its coalition treaty of 2013, the German government promised to introduce a general copyright clause in favour of education and science. In Chap. 5 we evaluate whether the new proposal keeps this promise or at least, whether the new paragraphs can be considered a step in the right direction towards a modern science copyright. Considering the approaching end of the current legislative term, no one knows whether the members of the German parliament will be able to adopt the proposal in time Sect. 6). If not, a new government in its next legislative term will again be confronted with the challenge of a general copyright clause in favour of education and science. The eight new copyright exceptions currently under consideration are listed in the appendix.RésuméLe projet de loi actuel (RefE) du Bundesministerium der Justiz und für Verbraucherschutz (BMJV, Ministère fédéral de la Justice et la Protection des Consommateurs) pour la réforme du droit d'auteur allemand est en cours de discussion dans le domaine de l'éducation et des sciences. La proposition doit être vue comme une réponse aux problèmes évidents des dispositions du droit d'auteur en rapport avec l'éducation et les sciences. Ces problèmes sont traités dans le ch. 2. Les nouvelles restrictions réglementaires proposées sont présentées en détail (ch. 3) et de manière critique (de façon négative et constructive – chap. 4). L’auteur vérifie également si la proposition atteint l'objectif initial du Gouvernement fédéral de créer un cadre général favorable à l’éducation et aux sciences, ou si la proposition actuelle peut au moins être considérée comme une solution (provisoire) acceptable pour un droit d'auteur moderne (ch. 5). Enfin, le ch. 6 détermine si le processus de débats parlementaires concernant le RefE peut encore être complété pendant la législature actuelle. Dans l'annexe vous trouverez les huit nouvelles restrictions tels que prévues dans la proposition.Deskriptoren: Bibliothek; Bildung; BMJV; EuGH; Kopie; Lizenz; Gesetzgebung; Urheberrecht; Vergütung; Verlag; Wissenschaft und Technik; BGH; DeutschlandKeywords: BGH (German Federal Supreme Court); library; education; BMJV (Federal Ministry of Justice and Consumer Protection); BverfG (Federal Constitutional Court); EuGH (European Court of Justice); copy; licence; exception and limitations; TDM (Text and Data Mining); copyright; remuneration; publisher; science; copyright clause for education and science; GermanyDescripteurs: bibliothèque; éducation; BMJV; CJUE; copie; licence; législation; droit d'auteur; rémunération; édition; sciences et technologie; BGHOnline erschienen: 2017-5-5© 2017 Walter de Gruyter GmbH, Berlin\/Boston",
        "abstractEn": "",
        "categories": [
            "Information – Wissenschaft & Praxis"
        ],
        "lang": "de",
        "guid": "https:\/\/doi.org\/10.1515\/iwp-2017-0027"
    },
    {
        "title": "Die Themen Datenschutz und Privatsphäre im Schulunterricht: Was können Interventionen und Aufklärungsmaßnahmen bewirken?",
        "link": "https:\/\/doi.org\/10.1515\/iwp-2025-2032",
        "authors": [
            "Dominik Hofmann",
            "Steffen Lemke",
            "Isabella Peters"
        ],
        "pubDate": "Fri, 03 Oct 2025 00:00:00 +0000",
        "abstract": "Zusammenfassung Social Media sind für junge Erwachsene alltäglich und ein wesentlicher Bestandteil der heutigen Datenökonomie. Diese Arbeit untersucht, wie Schülerinnen und Schüler des beruflichen Gymnasiums einer deutschen berufsbildenden Schule mit Datenschutz- und Privatsphäreneinstellungen auf Instagram in Abhängigkeit einer Aufklärungsintervention umgehen. Die Ergebnisse zeigen, dass die Einstellungen der Probandinnen und Probanden zunächst überwiegend mit Standardwerten konfiguriert waren. Nach der Intervention haben viele Teilnehmende Änderungen an ihren Einstellungen vorgenommen, was auf ein gestiegenes Datenschutzbewusstsein hinweist. Abstract Social media is commonplace for young adults and an essential part of today’s data economy. This paper examines how students at a German vocational high school deal with data protection and privacy settings on Instagram as a function of an educational intervention. The results show that the participants’ settings were initially predominantly configured with default values. After the intervention, many participants made changes to their settings, which indicates an increased awareness of data protection. Résumée Les réseaux sociaux sont monnaie courante chez les jeunes adultes et constituent un élément essentiel de l’économie des données actuelle. Cet article examine comment les lycéens gèrent la protection des données et les paramètres de confidentialité sur Instagram à la suite d’une intervention éducative. Les résultats montrent que les paramètres des participants étaient initialement et principalement configurés avec des valeurs par défaut. Après l’intervention, de nombreux participants ont modifié leurs paramètres, ce qui indique une sensibilisation accrue à la protection des données. Deskriptoren: Empirische Untersuchung; Jugendliche; Instagram; Datenschutz; Benutzerausbildung; LernenDescriptors: Empirical study; Young people; Instagram; Data protection; User education; LearningDescripteurs: Étude empirique; Jeunes; Instagram; Protection des données; Formation des utilisateurs; ApprentissageÜber die AutorenDominik Hofmann Dominik Hofmann hat 2024 seinen Master in Informatik und Wirtschaftswissenschaften mit dem Profil Wirtschaftspädagogik an der Christian-Albrechts-Universität zu Kiel abgeschlossen. Seit Februar 2025 absolviert er das Referendariat in der Fachrichtung Wirtschaft & Verwaltung sowie im Fach Berufliche Informatik an der HLA – Die Flensburger Wirtschaftsschule. Nebenberuflich ist er seit vielen Jahren als Programmierer und im IT-Support tätig. Dr. Steffen Lemke Steffen Lemke ist PostDoc und wissenschaftlicher Mitarbeiter in der Arbeitsgruppe für Web Science am Institut für Informatik der Christian-Albrechts-Universität zu Kiel und an der ZBW – Leibniz-Informationszentrum Wirtschaft. Prof. Dr. Isabella Peters Isabella Peters studierte Germanistische Sprachwissenschaft, Neuere deutsche Literaturwissenschaft und Informationswissenschaft an der Heinrich-Heine-Universität Düsseldorf, wo sie 2009 promoviert wurde. Seit 2013 hat sie die Professur für Web Science, ZBW – Leibniz-Informationszentrum Wirtschaft, Christian-Albrechts-Universität zu Kiel inne. Literatur 20 Jahre Facebook: Von Fake News, Datenschutz und Meinungsmacht, 2024. [online]. [ZDFinfo Doku]. 20 Jahre Facebook: Von Fake News, Datenschutz und Meinungsmacht. https:\/\/www.youtube.com\/watch?v=xCHxug5_8gM.Search in Google Scholar Acquisti, Alessandro, Laura Brandimarte und George Loewenstein, 2015. Privacy and human behavior in the age of information. Science. 30 Januar 2015. Bd. 347, Nr. 6221, S. 509–514. DOI 10.1126\/science.aaa1465.10.1126\/science.aaa1465Search in Google Scholar Autorengruppe Bildungsberichterstattung, 2020. Bildung in Deutschland: ein indikatorengestützter Bericht mit einer Analyse zu Bildung in einer digitalisierten Welt. 2020. Bielefeld: wbv. ISBN 978-3-7639-6130-6.Search in Google Scholar Baldwin, Lola, Jared Gores und Jp Kilbride, 2023. Social Media Use and Awareness of Privacy Concerns. Concordia Journal of Communication Research [online]. 2023. Bd. 8. DOI 10.54416\/HQWT8424. https:\/\/digitalcommons.csp.edu\/comjournal\/vol8\/iss1\/1\/ [27 Mai 2025].10.54416\/HQWT8424Search in Google Scholar Engels, Barbara, 2018. Datenschutzpräferenzen von Jugendlichen in Deutschland. IW-Trends [online]. 2018. Nr. 2. DOI 10.2373\/1864-810X.18-02-02. https:\/\/doi.org\/10.2373\/1864-810X.18-02-02 [14 März 2024].Search in Google Scholar Fujitsu, 2022. Fujitsu-Umfrage: Europäische Schulen können bei digitaler Kompetenz nicht Schritt halten. [online]. https:\/\/www.fujitsu.com\/de\/about\/resources\/news\/press-releases\/2022\/20220404.html [4 April 2022].Search in Google Scholar Gruzd, Anatoliy, Joanne McNeish, Lilach Dahoah Halevi und Martin Phillips, 2021. Seeing Self in Data: The Effect of a Privacy Literacy Intervention on Facebook Users’ Behaviour. SSRN Electronic Journal [online]. 2021. DOI 10.2139\/ssrn.3946376. https:\/\/www.ssrn.com\/abstract=3946376 [27 Mai 2025].10.2139\/ssrn.3946376Search in Google Scholar Koch, Wolfgang, 2023. Ergebnisse der ARD\/ZDF-Onlinestudie 2023. [online]. November 2023. https:\/\/www.ard-media.de\/fileadmin\/user_upload\/media-perspektiven\/pdf\/2023\/MP_26_2023_Onlinestudie_2023_Social_Media.pdf.Search in Google Scholar Kohne, Julian, Josephine B. Schmitt und Johannes Breuer, 2023. Einführung: Digitalisierungsforschung. Ein Einblick in die Bandbreite der Forschung zu und mit digitalen Daten. easy social sciences. 2023. Bd. 69, S. 310. DOI 10.15464\/EASY.2023.07.Search in Google Scholar Kolo, Castulus, 2021. Die Ökonomie sozialer Medien. In: Jan-Hinrik Schmidt und Monika Taddicken (Hrsg.), Handbuch Soziale Medien [online]. Wiesbaden: Springer Fachmedien Wiesbaden. S. 1–23. Springer Reference Sozialwissenschaften. ISBN 978-3-658-03895-3. https:\/\/link.springer.com\/10.1007\/978-3-658-03895-3_17-2 [3 März 2024].10.1007\/978-3-658-03895-3_17-2Search in Google Scholar Masur, Philipp K, Doris Teutsch und Sabine Trepte, [kein Datum]. OPLIS Manual. [online]. https:\/\/www.oplis.de\/docs\/OPLIS_Manual_deutsch.pdf.Search in Google Scholar Masur, Philipp K., Doris Teutsch und Sabine Trepte, 2017. Entwicklung und Validierung der Online-Privatheitskompetenzskala (OPLIS). Diagnostica. Oktober 2017. Bd. 63, Nr. 4, S. 256–268. DOI 10.1026\/0012-1924\/a000179.10.1026\/0012-1924\/a000179Search in Google Scholar Medienpädagogischer Forschungsverbund Südwest, 2023. JIM-Studie 2023 - Jugend, Information, Medien. [online]. 2023. https:\/\/www.mpfs.de\/fileadmin\/files\/Studien\/JIM\/2022\/JIM_2023_web_final_kor.pdf.Search in Google Scholar MERZ, Redaktion, 2016. Gapski, Harald (Hrsg.) (2015). Big Data und Medienbildung. Zwischen Kontrollverlust, Selbstverteidigung und Souveränität in der digitalen Welt. Schriftenreihe zur digitalen Gesellschaft NRW, Band 3. München: kopaed. 139 S., 14,80 €. merz | medien + erziehung. 10 Februar 2016. Bd. 60, Nr. 1, S. 90–91. DOI 10.21240\/merz\/2016.1.27.10.21240\/merz\/2016.1.27Search in Google Scholar Rohleder, Bernhard, 2023. Wie die Deutschen Social Media nutzen. [online]. 7 Februar 2023. Verfügbar unter: https:\/\/www.bitkom.org\/sites\/main\/files\/2023-02\/BitkomChartsSocialMedia2023_0.pdf.Search in Google Scholar Saurwein, Florian und Charlotte Spencer-Smith, 2021. Automated Trouble: The Role of Algorithmic Selection in Harms on Social Media Platforms. Media and Communication. 18 November 2021. Bd. 9, Nr. 4, S. 222–233. DOI 10.17645\/mac.v9i4.4062.10.17645\/mac.v9i4.4062Search in Google Scholar Sicher unterwegs auf Social Media | #1 Basics, 2021. [online]. [Sicher unterwegs auf Social Media]. #1 Basics. https:\/\/www.ardmediathek.de\/video\/so-geht-medien\/sicher-unterwegs-auf-social-media-oder-1-basics\/br-de\/Y3JpZDovL2JyLmRlL3ZpZGVvL2ViYTliMGE5LTVlMDEtNGRkOC1iNTg4LWNmOTc5NjlhMzY0Yw?isChildContent=.Search in Google Scholar Soziale Medien: Wie sicher sind unsere Daten?, 2018. [online]. https:\/\/programm.ard.de\/TV\/Themenschwerpunkte\/Dokus–Reportagen\/Wissensmagazine\/Startseite\/?sendung=281111242357799 [19. April 2024], inzwischen https:\/\/www.youtube.com\/watch?v=HfK9qPRr6js&t=1741s [5. Juni 2025].Search in Google Scholar Suter, Paolo M., 2018. There Is No Such Thing as a Free Lunch. Praxis. September 2018. Bd. 107, Nr. 19, S. 1005–1005. DOI 10.1024\/1661-8157\/a003108.10.1024\/1661-8157\/a003108Search in Google Scholar Wagner, Ulrike, 2022. Kompetenzen für soziale Medien. In: Jan-Hinrik Schmidt und Monika Taddicken (Hrsg.), Handbuch Soziale Medien [online]. Wiesbaden: Springer Fachmedien Wiesbaden. S. 271–293. ISBN 978-3-658-25994-5. https:\/\/link.springer.com\/10.1007\/978-3-658-25995-2_15 [3 März 2024].Search in Google Scholar White, Candace L. und Brandon Boatwright, 2020. Social media ethics in the data economy: Issues of social responsibility for using Facebook for public relations. Public Relations Review. Dezember 2020. Bd. 46, Nr. 5, S. 101980. DOI 10.1016\/j.pubrev.2020.101980.10.1016\/j.pubrev.2020.101980Search in Google Scholar Danksagung Ich danke allen, die mich während der Durchführung und Fertigstellung dieser Arbeit unterstützt haben. Mein Dank gilt der HLA – Die Flensburger Wirtschaftsschule, zum einen der Schulleitung für die Erlaubnis zur Durchführung der Fallstudie und zum anderen den involvierten Lehrkräften, die mir ihre Unterrichtszeit zur Verfügung gestellt haben, aber auch den Schülerinnen und Schülern für ihre freiwillige Teilnahme. Online erschienen: 2025-10-03© 2025 Walter de Gruyter GmbH, Berlin\/Boston",
        "abstractEn": "",
        "categories": [
            "Information – Wissenschaft & Praxis"
        ],
        "lang": "de",
        "guid": "https:\/\/doi.org\/10.1515\/iwp-2025-2032"
    }
]